{"RegionalFcst":{"createdOn":"2015-04-14T15:12:57","issuedAt":"2015-04-14T16:00:00","regionId":"dg","FcstPeriods":{"Period":[{"id":"day1to2","Paragraph":[{"title":"Headline:","$":"Overnight rain, then brightening up with showers tomorrow."},{"title":"This Evening and Tonight:","$":"Cloudy but mainly dry in the evening though some patchy rain in west. Heavier more persistent rain spreading from northwest overnight but eastern Borders may stay dry. Fresh or strong southwesterly winds veering westerly later. Minimum Temperature 8C."},{"title":"Wednesday:","$":"Cloudy start with some heavy rain but brighter conditions and scattered showers spreading into all parts through the morning as winds turn northwesterly. Mainly dry with sunny spells in afternoon. Maximum Temperature 12C."}]},{"id":"day3to5","Paragraph":{"title":"Outlook for Thursday to Saturday:","$":"Perhaps the odd shower Thursday with fresh westerly winds, otherwise dry and bright with sunny spells and light winds. Best of sunshine in west by weekend, though chilly nights."}},{"id":"day6to15","Paragraph":{"title":"UK Outlook for Sunday 19 Apr 2015 to Tuesday 28 Apr 2015:","$":"Many areas will be fine and dry throughout Sunday and early next week with good sunny spells. There is a small risk of isolated showers in southern parts as well as the odd spot of rain in the far north. Temperatures by day will generally be a little above normal, perhaps feeling warm in sunnier spells, but nights will be chilly. Towards the end of next week and beyond, conditions are likely to slowly turn more unsettled. It is probable that some rain and stronger winds will spread to all areas, but there will be some drier and sunnier spells in between. After the rather warm start, temperatures are likely to fall closer to the seasonal average with some isolated frost still possible during settled spells."}},{"id":"day16to30","Paragraph":{"title":"UK Outlook for Wednesday 29 Apr 2015 to Wednesday 13 May 2015:","$":"Conditions during this period may be on the changeable side at first, although there is a lot of uncertainty about the likely weather types later this month and into early May. Some spells of fine and dry weather are likely, perhaps with the best of these over southern and eastern parts. Periods of cloudier weather with rain or showers are also likely at times, perhaps more likely in the north and west. Daytime temperatures will probably range from below average during unsettled weather to often above average when conditions are fine, and it will feel pleasantly warm as a result. As is common this time of year, settled spells may be accompanied by chilly evenings with some isolated frost in rural areas overnight."}}]}}}
