{"RegionalFcst":{"createdOn":"2015-04-14T03:43:17","issuedAt":"2015-04-14T04:00:00","regionId":"gr","FcstPeriods":{"Period":[{"id":"day1to2","Paragraph":[{"title":"Headline:","$":"Mainly cloudy Tuesday, patchy light rain, but some bright spells."},{"title":"Today:","$":"Mostly cloudy and breezy, though some bright spells and feeling warm in any sunshine, especially over Moray and northern Aberdeenshire. Mainly dry but a little rain at times, mainly in west and over Deeside though more widespread rain later. Maximum Temperature 16C."},{"title":"Tonight:","$":"Cloudy and breezy with outbreaks of rain, heaviest and most persistent in the west and along the Buchan coast. Clearing to scattered showers late in night as winds turn northwest. Minimum Temperature 8C."},{"title":"Wednesday:","$":"Rather cloudy with showers in morning though perhaps a spell of more prolonged rain. Drier and brighter in the afternoon with sunny spells, but cooler, fresh west or northwesterly winds. Maximum Temperature 13C."}]},{"id":"day3to5","Paragraph":{"title":"Outlook for Thursday to Saturday:","$":"Fresh westerly winds Thursday, with the odd shower, mostly in the north, otherwise dry and bright with sunny spells with light winds. Quite warm inland by day but chilly night."}},{"id":"day6to15","Paragraph":{"title":"UK Outlook for Sunday 19 Apr 2015 to Tuesday 28 Apr 2015:","$":"Many areas will be fine and dry throughout Sunday and early next week with good sunny spells. There is a small risk of isolated showers in southern parts as well as the odd spot of rain in the far north. Temperatures by day will generally be a little above normal, perhaps feeling warm in sunnier spells, but nights will be chilly. Towards the end of next week and beyond, conditions are likely to slowly turn more unsettled. It is probable that some rain and stronger winds will spread to all areas, but there will be some drier and sunnier spells in between. After the rather warm start, temperatures are likely to fall closer to the seasonal average with some isolated frost still possible during settled spells."}},{"id":"day16to30","Paragraph":{"title":"UK Outlook for Wednesday 29 Apr 2015 to Wednesday 13 May 2015:","$":"Conditions during this period may be on the changeable side at first, although there is a lot of uncertainty about the likely weather types later this month and into early May. Some spells of fine and dry weather are likely, perhaps with the best of these over southern and eastern parts. Periods of cloudier weather with rain or showers are also likely at times, perhaps more likely in the north and west. Daytime temperatures will probably range from below average during unsettled weather to often above average when conditions are fine, and it will feel pleasantly warm as a result. As is common this time of year, settled spells may be accompanied by chilly evenings with some isolated frost in rural areas overnight."}}]}}}
