{"RegionalFcst":{"createdOn":"2015-04-14T15:12:57","issuedAt":"2015-04-14T16:00:00","regionId":"ta","FcstPeriods":{"Period":[{"id":"day1to2","Paragraph":[{"title":"Headline:","$":"Overnight rain, then brightening up with a few showers tomorrow."},{"title":"This Evening and Tonight:","$":"Cloudy with fresh or strong southwest winds and outbreaks of rain, most persistent and heaviest in west, drier across Angus and Perthshire. Fresh southwesterly wind, veering westerly and easing later. Minimum Temperature 7C."},{"title":"Wednesday:","$":"Rain clearing away in morning, with some bright or sunny spells developing, although a few showers, mainly Perthshire and Angus. Mainly dry with longer spells of sunshine in afternoon. Breezy. Maximum Temperature 12C."}]},{"id":"day3to5","Paragraph":{"title":"Outlook for Thursday to Saturday:","$":"The odd shower Thursday with fresh westerly winds, otherwise dry with bright or sunny spells and light wind. Becoming cloudier in east so best of sunshine in west. Chilly nights"}},{"id":"day6to15","Paragraph":{"title":"UK Outlook for Sunday 19 Apr 2015 to Tuesday 28 Apr 2015:","$":"Many areas will be fine and dry throughout Sunday and early next week with good sunny spells. There is a small risk of isolated showers in southern parts as well as the odd spot of rain in the far north. Temperatures by day will generally be a little above normal, perhaps feeling warm in sunnier spells, but nights will be chilly. Towards the end of next week and beyond, conditions are likely to slowly turn more unsettled. It is probable that some rain and stronger winds will spread to all areas, but there will be some drier and sunnier spells in between. After the rather warm start, temperatures are likely to fall closer to the seasonal average with some isolated frost still possible during settled spells."}},{"id":"day16to30","Paragraph":{"title":"UK Outlook for Wednesday 29 Apr 2015 to Wednesday 13 May 2015:","$":"Conditions during this period may be on the changeable side at first, although there is a lot of uncertainty about the likely weather types later this month and into early May. Some spells of fine and dry weather are likely, perhaps with the best of these over southern and eastern parts. Periods of cloudier weather with rain or showers are also likely at times, perhaps more likely in the north and west. Daytime temperatures will probably range from below average during unsettled weather to often above average when conditions are fine, and it will feel pleasantly warm as a result. As is common this time of year, settled spells may be accompanied by chilly evenings with some isolated frost in rural areas overnight."}}]}}}
