{"RegionalFcst":{"createdOn":"2015-04-15T03:06:22","issuedAt":"2015-04-15T04:00:00","regionId":"sw","FcstPeriods":{"Period":[{"id":"day1to2","Paragraph":[{"title":"Headline:","$":"Remaining murky near western coasts, otherwise fine and warm today."},{"title":"Today:","$":"Any mist and fog quickly burning away, except near western coasts where it may remain murky for much of the day. Elsewhere, another mostly fine and warm day, however the outside chance of the odd shower developing later. Maximum Temperature 21C."},{"title":"Tonight:","$":"It will be a mainly fine evening and night across the region, with further clear spells. However still a low risk of the odd sharp shower developing in places. Minimum Temperature 7C."},{"title":"Thursday:","$":"Another mostly fine day with spells of warm sunshine, however cloud amounts will tend to increase throughout the day. Many places will be dry, but an isolated shower is possible. Maximum Temperature 19C."}]},{"id":"day3to5","Paragraph":{"title":"Outlook for Friday to Sunday:","$":"Still the risk of the odd shower on Friday, otherwise remaining mainly fine and settled but much cooler than of late, with a brisk wind developing along the south coast."}},{"id":"day6to15","Paragraph":{"title":"UK Outlook for Monday 20 Apr 2015 to Wednesday 29 Apr 2015:","$":"Many areas will be fine and dry early next week with good sunny spells. There is a small risk of isolated showers developing in southern parts as well as the odd spot of rain in the far north and east. Temperatures by day will generally be a little above normal, typically feeling warm in sunnier spells, but nights will continue to be chilly. Towards the end of next week and more especially during the start of the final week of April, there is a chance of it generally turning more unsettled with some outbreaks of rain developing and temperatures falling closer to the seasonal average. A local frost is still possible during any clearer spells."}},{"id":"day16to30","Paragraph":{"title":"UK Outlook for Thursday 30 Apr 2015 to Thursday 14 May 2015:","$":"Conditions during this period may be on the changeable side at first, although there is a lot of uncertainty about the likely weather types later this month and into early May. Some spells of fine and dry weather are likely, perhaps with the best of these over southern and eastern parts. Periods of cloudier weather with rain or showers are also likely at times, perhaps more likely in the north and west. Daytime temperatures will probably range from below average during unsettled weather to often above average when conditions are fine, and it will feel pleasantly warm in the sunnier spells as a result. As is common this time of year, settled spells may be accompanied by chilly evenings with some isolated frost in rural areas overnight."}}]}}}
