{"RegionalFcst":{"createdOn":"2015-04-15T03:27:25","issuedAt":"2015-04-15T04:00:00","regionId":"gr","FcstPeriods":{"Period":[{"id":"day1to2","Paragraph":[{"title":"Headline:","$":"Sunny spells, perhaps the odd shower"},{"title":"Today:","$":"Cloudy at first with a few light showers but soon becoming dry with sunny spells. A few isolated showers building in the afternoon mainly towards Banff and Buchan, best of the sunshine around Stonehaven. Fresh westerly breeze, falling light later. Maximum Temperature 12C."},{"title":"Tonight:","$":"Dry through the evening with light winds and sunny spells, cloud increasing from the west overnight with perhaps some light rain over western Aberdeenshire. Minimum Temperature 2C."},{"title":"Thursday:","$":"Cloudy at first with some spots of rain in the west but cloud thinning and breaking with some sunshine. Perhaps the odd shower breaking out later towards Deeside and Stonehaven. Maximum Temperature 13C."}]},{"id":"day3to5","Paragraph":{"title":"Outlook for Friday to Sunday:","$":"Mostly dry and settled weather conditions will continue through the weekend with some sunny or clear spells and feeling mild with light winds. Chilly at night with some frosts."}},{"id":"day6to15","Paragraph":{"title":"UK Outlook for Monday 20 Apr 2015 to Wednesday 29 Apr 2015:","$":"Many areas will be fine and dry early next week with good sunny spells. There is a small risk of isolated showers developing in southern parts as well as the odd spot of rain in the far north and east. Temperatures by day will generally be a little above normal, typically feeling warm in sunnier spells, but nights will continue to be chilly. Towards the end of next week and more especially during the start of the final week of April, there is a chance of it generally turning more unsettled with some outbreaks of rain developing and temperatures falling closer to the seasonal average. A local frost is still possible during any clearer spells."}},{"id":"day16to30","Paragraph":{"title":"UK Outlook for Thursday 30 Apr 2015 to Thursday 14 May 2015:","$":"Conditions during this period may be on the changeable side at first, although there is a lot of uncertainty about the likely weather types later this month and into early May. Some spells of fine and dry weather are likely, perhaps with the best of these over southern and eastern parts. Periods of cloudier weather with rain or showers are also likely at times, perhaps more likely in the north and west. Daytime temperatures will probably range from below average during unsettled weather to often above average when conditions are fine, and it will feel pleasantly warm in the sunnier spells as a result. As is common this time of year, settled spells may be accompanied by chilly evenings with some isolated frost in rural areas overnight."}}]}}}
